&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("IdInstance") Тогда
		Объект.IdInstance = Параметры.IdInstance;
	КонецЕсли;
	
	Если Параметры.Свойство("ApiToken") Тогда
		Объект.ApiToken = Параметры.ApiToken;
	КонецЕсли;
	
	ЗаполнитьФормуГеолокации();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьФормуГеолокации()
	
	НазваниеЛокации = "Локация";
	Адрес  			= "Адрес";
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если ПроверитьЗаполнение() Тогда
		ОповеститьОВыборе(Новый Структура("ИмяФормы,НазваниеЛокации,Адрес,Широта,Долгота", "ВыборГеолокации", НазваниеЛокации, Адрес, Широта, Долгота));
	КонецЕсли;
КонецПроцедуры
