&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("IdInstance") Тогда
		Объект.IdInstance = Параметры.IdInstance;
	КонецЕсли;
	
	Если Параметры.Свойство("ApiToken") Тогда
		Объект.ApiToken = Параметры.ApiToken;
	КонецЕсли; 
	
	ЗаполнитьФормуОпроса();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьФормуОпроса()
	
	Вопрос = "Сколько углов у треугольника?";
	
	ВариантыОтветов.Добавить("Три",        "Три");
	ВариантыОтветов.Добавить("Шесть",      "Шесть");
	ВариантыОтветов.Добавить("Двенадцать", "Двенадцать");
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если ПроверитьЗаполнение() Тогда
		ОповеститьОВыборе(Новый Структура("ИмяФормы, Вопрос, НесколькоВариантов, ВариантыОтветов", "СоздатьОпрос", Вопрос, 
			НесколькоВариантов, ВариантыОтветов));
	КонецЕсли;
КонецПроцедуры
