
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("IdInstance") Тогда
		Объект.IdInstance = Параметры.IdInstance;
	КонецЕсли;
	
	Если Параметры.Свойство("ApiToken") Тогда
		Объект.ApiToken = Параметры.ApiToken;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если ПроверитьЗаполнение() Тогда
		ЕстьРасширениеФайла = СтрНайти(ИмяФайла,  ".", НаправлениеПоиска.СКонца) <> 0;
		Если Не ЕстьРасширениеФайла Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Имя файла должно содержать расширение";
			Сообщение.Поле = "ИмяФайла";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		ОповеститьОВыборе(Новый Структура("ИмяФормы,АдресФайла,ИмяФайла", "ВыборСсылкиНаФайл", АдресФайла, ИмяФайла));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

