&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("IdInstance") Тогда
		Объект.IdInstance = Параметры.IdInstance;
	КонецЕсли;
	
	Если Параметры.Свойство("ApiToken") Тогда
		Объект.ApiToken = Параметры.ApiToken;
	КонецЕсли; 
	
	ЗаполнитьФормуКонтакта();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьФормуКонтакта()
	
	Телефон  = Число("78087771122");
	Фамилия  = "Иванов";
	Имя      = "Иван";
	Отчество = "Иванович";   
	
	Компания = "Рога и Копыта";
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)  
	
	Закрыть(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;			
	КонецЕсли;
	
	ОповеститьОВыборе(Новый Структура("ИмяФормы, Телефон, Имя, Фамилия, Отчество, Компания", "ВыборКонтакта", Телефон, 
		Имя, Фамилия, Отчество, Компания));
	
КонецПроцедуры
