
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("IdInstance") Тогда
		//@skip-check unknown-form-parameter-access
		Объект.IdInstance = Параметры.IdInstance;
	КонецЕсли;
	
	Если Параметры.Свойство("ApiToken") Тогда
		//@skip-check unknown-form-parameter-access
		Объект.ApiToken = Параметры.ApiToken;
	КонецЕсли; 
	
	ДобавитьКнопкуВИнтерфейсНаСервере("Скопировать инстанс", "copy", Параметры.IdInstance);
	ДобавитьКнопкуВИнтерфейсНаСервере("Перейти на сайт", "url", "https://green-api.com");
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Кнопки.Количество() Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Нужно добавить хотя бы одну кнопку'; en = 'You need to create at least one button'"));
	КонецЕсли;
	
	Если Кнопки.НайтиСтроки(Новый Структура("Значение", "")).Количество() Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Не указано значение кнопки'; en = 'Button value not set'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ТипыКнопок = ТипыКнопок();
		МассивКнопок = Новый Массив;
		Для Каждого Строка Из Кнопки Цикл
			МассивКнопок.Добавить(Новый Структура("type, buttonId, buttonText, " + ТипыКнопок[Строка.ТипКнопки],
					Строка.ТипКнопки, Строка.стрИдКнопки, Строка.Заголовок, Строка.Значение));
		КонецЦикла;
		
		//@skip-check structure-consructor-too-many-keys
		ОповеститьОВыборе(Новый Структура("ИмяФормы, Заголовок, Тело, Подвал, Кнопки",
				"ВыборКнопок", ЗаголовокСообщения, ТелоСообщения, ПодвалСообщения, МассивКнопок));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ДобавитьКнопкуВИнтерфейсНаСервере(Заголовок = "Скопировать", ТипКнопки = "copy", ЗначениеКнопки = "copy")
	
	СтрокаКнопки = новыйСтрокаКнопка(Заголовок, ТипКнопки, ЗначениеКнопки);
	СтрИдКнопки = СтрокаКнопки.стрИдКнопки;
	ИмяКнопка = "Кнопка_" + стрИдКнопки;
	ТипИмяКнопка = "Тип" + ИмяКнопка;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяКнопка, Новый ОписаниеТипов("Строка")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ТипИмяКнопка, Новый ОписаниеТипов("Строка")));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Группа = Элементы.Добавить("Группа" + СтрИдКнопки, Тип("ГруппаФормы"), Элементы.ГруппаКнопок);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь; 
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НоваяКнопка = Элементы.Добавить(ИмяКнопка, Тип("КнопкаФормы"), Группа);
	НоваяКнопка.Заголовок = Заголовок;
	НоваяКнопка.Высота = 2;
	НоваяКнопка.ИмяКоманды = "КнопкаНажатие";
	Команды.Найти("КнопкаНажатие").Подсказка = НСтр("ru = 'Переименовать'; en = 'Rename'");
	
	НовыйЭлемент = Элементы.Добавить(ТипИмяКнопка, Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаСпискаВыбора = Истина;
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.РедактированиеТекста = Ложь;
	НовыйЭлемент.Заголовок = "Тип кнопки";
	НовыйЭлемент.ПутьКДанным = ТипИмяКнопка;
	ЗагрузитьСписокТипов(НовыйЭлемент.СписокВыбора);
	ЭтотОбъект[ТипИмяКнопка] = СтрокаКнопки.ТипКнопки;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииТипаКнопки");
	
	НовыйЭлемент = Элементы.Добавить("Значение" + ИмяКнопка, Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = СтрокаКнопки.ТипКнопки;
	НовыйЭлемент.ПутьКДанным = ИмяКнопка;
	ЭтотОбъект[ИмяКнопка] = ЗначениеКнопки;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииЗначенияКнопки");
	
	НовыйЭлемент = Элементы.Добавить("Удалить" + ИмяКнопка, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "удалить";
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "УдалитьКнопку");
	
КонецПроцедуры
&НаСервере
Процедура УдалитьКнопкуНаСервере(стрИдКнопки)

	Элементы.Удалить(Элементы["Группа" + стрИдКнопки]);
	Кнопки.Удалить(Кнопки.НайтиСтроки(Новый Структура("стрИдКнопки", стрИдКнопки))[0]);
	
	УдаляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты.Добавить("Кнопка_" + стрИдКнопки);
	УдаляемыеРеквизиты.Добавить("ТипКнопка_" + стрИдКнопки);
	ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
КонецПроцедуры
&НаКлиенте
Процедура УдалитьКнопку(Декорация)
	
	УдалитьКнопкуНаСервере(стрИдКнопки(Декорация.Имя));
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КнопкаНажатие(Команда)
	
	СтрИдКнопки = стрИдКнопки(ТекущийЭлемент.Имя);
	СтрокаКнопка = СтрокаКнопка(СтрИдКнопки);
	Строка = Ждать ВвестиСтрокуАсинх(СтрокаКнопка.Заголовок, "Текст заголовка кнопки", 25);
	Если Строка <> Неопределено Тогда
		Элементы["Кнопка_" + СтрИдКнопки].Заголовок = Строка;
		СтрокаКнопка.Заголовок = Строка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТипаКнопки(Элемент)
	
	ТипКнопки = ЭтотОбъект[Элемент.Имя];
	СтрИдКнопки = стрИдКнопки(Элемент.Имя);
	СтрокаКнопка(СтрИдКнопки).типКнопки = ТипКнопки;
	Элементы["ЗначениеКнопка_" + СтрИдКнопки].Заголовок = ТипКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗначенияКнопки(Элемент)
	
	СтрИдКнопки = стрИдКнопки(Элемент.Имя);
	СтрокаКнопка(СтрИдКнопки).Значение = ЭтотОбъект["Кнопка_" + стрИдКнопки];
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКнопкуНажатие(Элемент)
	
	МаксКнопок = 3;
	Если Кнопки.Количество() = МаксКнопок Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Максимум кнопок за вызов '; en = 'Max buttons - '") + МаксКнопок);
	Иначе
		ДобавитьКнопкуВИнтерфейсНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТипыКнопок()
	
	ТипыКнопок = Новый Структура;
	ТипыКнопок.Вставить("copy", "copyCode");
	ТипыКнопок.Вставить("call", "phoneNumber");
	ТипыКнопок.Вставить("url", "url");
	
	Возврат ТипыКнопок;
	
КонецФункции
&НаСервере
Процедура ЗагрузитьСписокТипов(Список)
	
	Типы = ТипыКнопок();
	Для Каждого Элемент Из Типы Цикл
		Список.Добавить(Элемент.Ключ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция новыйСтрокаКнопка(Заголовок, ТипКнопки, ЗначениеКнопки)
	
	ИдКнопки = ИдКнопки + 1;
	
	НовСтрока = Кнопки.Добавить();
	НовСтрока.стрИдКнопки = Формат(ИдКнопки, "ЧГ=");
	НовСтрока.ТипКнопки = ТипКнопки;
	НовСтрока.Заголовок = Заголовок;
	НовСтрока.Значение = ЗначениеКнопки;
	
	Возврат НовСтрока;
	
КонецФункции
&НаКлиенте
Функция СтрокаКнопка(СтрИдКнопки)
	
	Возврат Кнопки.НайтиСтроки(Новый Структура("стрИдКнопки", СтрИдКнопки))[0]; 
	
КонецФункции
&НаКлиенте
Функция стрИдКнопки(ИмяЭлемента)
	
	Возврат Сред(ИмяЭлемента, СтрНайти(ИмяЭлемента, "_") + 1);
	
КонецФункции

#КонецОбласти

